# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [36]:
# import numpy and pandas
import pandas as pd
import numpy as np
from scipy.stats import trim_mean, mode, skew, gaussian_kde, pearsonr, spearmanr, beta
from statsmodels.stats.weightstats import ztest as ztest

from scipy.stats import ttest_ind, norm, t
from scipy.stats import f_oneway
from scipy.stats import sem
from scipy import stats

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents

In [37]:
# Run this code:
salaries = pd.read_csv('../data/Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [38]:
# Your code here
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

In [39]:
#TO GET UNDERSTAND THE DATA, VALUES LIKE MEAN OR STD COULD BE RELEVANT
salaries.describe()

       Typical Hours  Annual Salary  Hourly Rate
count    8022.000000   25161.000000  8022.000000
mean       34.507604   86786.999790    32.788558
std         9.252077   21041.354602    12.112573
min        10.000000    7200.000000     2.650000
25%        20.000000   76266.000000    21.200000
50%        40.000000   90024.000000    35.600000
75%        40.000000   96060.000000    40.200000
max        40.000000  300000.000000   109.000000

In [40]:
#WE WANT TO KNOW THE SIZE OF THE FILE
salaries.shape

(33183, 8)

In [41]:
#WE WANT TO KNOW IF THERE IS ANY NULL VALUE IN THE DATA
#THE SHAPE INDICATE US THE AMOUNT OF ROWS AND WITH ISNULL().SUM() TELL US HOW MANY NULL VALUES DO WE HAVE
salaries.isnull().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        25161
Annual Salary         8022
Hourly Rate          25161
dtype: int64

# Challenge 2
This is a placeholder to make the AI corrector be able to find the correct exercise for feedback

# Challenge 3 - Constructing Confidence Intervals

We will test whether the hourly wage of all hourly workers is significantly different from $30/hr.

In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. Is $30/hr within that interval?

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [43]:
# Your code here
#Confidence level 0.95
#Degrees of freedom = n-1
#Mean of the sample 
#Standar error of the mean(SEM)
#COLUMN TO USE IS 'Hourly Rate'. THIS COLUMN CONTAINS MULTIPLE NULL VALUES. WE NEED TO DROP THEM TO MAKE OUR ANALYSIS

#REMOVE ALL THE NULL VALUES
clean_data = salaries['Hourly Rate'].dropna()

#TO GET HOW MANY RECORDS DO WE HAVE
n = len(clean_data)
#TO GE THE MEAN OF THE DATABASE-COLUMN
mean = np.mean(clean_data)
#HOW MUCH THE DATA SPREADS AROUND THE MEAN
std = clean_data.std()
#TELL YOU HOW MUCH THE SAMPLE MEAN MIGHT VARY IF YOU TOOK DIFFERENT SAMPLES
sem =  stats.sem(clean_data)

#DEGREES OF FREEDOM
df = n -1

#CONFIDENCE INTERVAL (95%)
#YOU WANT TO FIND A RANGE WHERE THE TURE MENA LIES WITH 95% CONFIDENCE.
confidence_level = 0.95
#CALCULATES THE CONFIDENCE INTERVAL USING THE T-DISTRIBUTION. IT GIVES YOU THE LOWER AND UPPER BOUND OF THE RANGE.
confidence_interval = stats.t.interval(confidence_level, df, loc=mean, scale=sem)

print(mean)
print(confidence_interval)

32.78855771628024
(32.52345834488425, 33.05365708767623)

This is fine if we have thousands of worker data. But what if we have only 100 workers data?

Sample 100 workers and re-construct the 95% confidence interval. Is the interval wider of narrower? And why?
Do you still encapsulate the $30/hr mark in this case?

In [53]:
# Your code here

#TO GET A SAMPLE OF THE DATABASE
sample_100 = clean_data.sample(n=100)
#TO GET A SAMPLE MEAN
mean_sample = np.mean(sample_100)

sem_sample = stats.sem(sample_100)
confidence_interval_sample = stats.t.interval(confidence_level, df, loc = mean_sample, scale=sem_sample)

#print(sample_100)
print(mean_sample)
print(confidence_interval_sample)

#THE INTERVAL IS WIDER. DUE TO THE SAMPLE VALUE THAT WHERE CONSIDER
#IN THIS CASE $30HR MARK IS IN THE RANGE

32.02160000000001
(29.707230355803524, 34.33596964419649)